print("----------定义字典-----------")
# 定义字典
my_dict1 = {"张三": 23, "李四": 24, "王五": 25}

print("----------定义空字典-----------")
# 定义空字典
my_dict2 = {}
my_dict3 = dict()
print(f"字典1的内容是：{my_dict1},类型是：{type(my_dict1)}")
print(f"字典2的内容是：{my_dict2},类型是：{type(my_dict2)}")
print(f"字典3的内容是：{my_dict3},类型是：{type(my_dict3)}")

print("----------定义重复key的字典-----------")
# 定义重复key的字典
# my_dict1 = {"张三": 23, "张三": 23, "李四": 24, "王五": 25}
# print(f"字典1的内容是：{my_dict1}")

print("----------从字典中基于key获取value-----------")
# 从字典中基于key获取value
age = my_dict1["张三"]
print(f"张三的年龄是：{age}")

print("----------定义嵌套字典-----------")
# 定义嵌套字典
my_dict_score = {
    "张三": {"语文": 77, "数学": 88, "英语": 66},
    "李四": {"语文": 66, "数学": 99, "英语": 55},
    "王五": {"语文": 89, "数学": 90, "英语": 33},
}
print("这里是字典的嵌套")

print("----------从嵌套字典中获取数据-----------")
# 从嵌套字典中获取数据
score = my_dict_score["张三"]["语文"]
print(f"张三的语文成绩:{score}")
